src/Catalogs/ПрайсЛист.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ПрайсЛист</Name>
			<Comment>Прайс-лист товаров</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ВидыПрайсЛистов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Элемент номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/Цены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Цены</Name>
			<Comment>Цены</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>Тип цен, для которого хранятся цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура для которой сохраняются цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры для которой сохраняются цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>Единица измерения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Поставщик, историю цен которого необходимо хранить. Если &lt;пусто&gt;, то цену установили мы.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорВзаиморасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/ПрайсЛист/Forms/ФормаСписка/Ext/Form/Module.bsl
// Модуль формы списка справочника "Прайс лист"


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Функция ДобавлятьТовар(ЗначениеВыбора)
	
	ДобавлятьТовар = Ложь;
	
	Если ВладелецПрайса.ФлагУникальности Тогда
		Запрос=Новый Запрос("
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ПрайсЛист.Номенклатура
		|ИЗ
		|	Справочник.ПрайсЛист КАК ПрайсЛист
		|ГДЕ
		|ПрайсЛист.Номенклатура = &ИсходнаяНоменклатура
		|И ПрайсЛист.Владелец = &ИсходныйВладелец
		|");
		Запрос.УстановитьПараметр("ИсходнаяНоменклатура",ЗначениеВыбора);
		Запрос.УстановитьПараметр("ИсходныйВладелец",ВладелецПрайса);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Количество()=0 Тогда
			ДобавлятьТовар=Истина;
		Иначе
			ВывестиСообщение(НСтр("ru='Товар не уникален.'"));
		КонецЕсли;
	Иначе
		ДобавлятьТовар=Истина;
	КонецЕсли;
	
	Возврат ДобавлятьТовар;
	
КонецФункции // ДобавлятьТовар()

// Процедура обновляет выпадающее меню с видами прайсов, если в форме справочника "ВидыПрайсЛистов"
// происходят какие-либо изменения элементов (удаление, добавление, пометка и т.д.).
&НаСервере
Процедура ОбновитьСписокВидовПрайсов() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВидыПрайсЛистов.Наименование,
	                      |	ВидыПрайсЛистов.Ссылка
	                      |ИЗ
	                      |	Справочник.ВидыПрайсЛистов КАК ВидыПрайсЛистов
	                      |ГДЕ
	                      |	ВидыПрайсЛистов.ПометкаУдаления = ЛОЖЬ");
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Номер = 0;
	Пока Выборка.Следующий() Цикл
		
		ИмяОперации = ""+Выборка.Наименование;
		КомандаОперации = Команды.Добавить("ВидПрайсЛиста" + Номер);
		КомандаОперации.Заголовок = ИмяОперации;
		КомандаОперации.Действие  = "Подключаемый_ОбработкаКомандыФормы";
		КнопкаОперации = Элементы.Добавить("ВидПрайсЛиста" + Номер, Тип("КнопкаФормы"), Элементы.ВидПрайса);
		КнопкаОперации.ИмяКоманды = "ВидПрайсЛиста" + Номер;
		КнопкаОперации.Заголовок = ИмяОперации;
		КнопкаОперации.Пометка    = Ложь;
		// Запомним ссылку на вид прайс листа
		НоваяСтрока = ВидыПрайсЛиста.Добавить();
		НоваяСтрока.ВидПрайсЛиста = Выборка.Ссылка;
		НоваяСтрока.ИмяКоманды = "ВидПрайсЛиста" + Номер;
		Номер = Номер + 1;
		
	КонецЦикла;
	
	Для каждого КнопкаОперации Из Элементы.ВидПрайса.ПодчиненныеЭлементы Цикл
		КнопкаОперации.Пометка = (КнопкаОперации.Заголовок=ВладелецПрайса.Наименование);
	КонецЦикла;
	
КонецПроцедуры // ОбновитьСписокВидовПрайсов()

// Производит настройку параметров выбора элементов управления диалога в зависимости от значений реквизитов объекта.
//
&НаСервере
Процедура НастроитьПараметрыВыбораЭлементовФормы()
	
	// Отбор для списка
	Список.Отбор.Элементы.Очистить();
	ЭлементОтбора = Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Владелец");
	ЭлементОтбора.Использование  = ИСТИНА;
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = ВладелецПрайса;
	
	// Отбор для дерева
	Дерево.Отбор.Элементы.Очистить();
	ЭлементОтбора = Дерево.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Владелец");
	ЭлементОтбора.Использование  = ИСТИНА;
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = ВладелецПрайса;
	
КонецПроцедуры // НастроитьПараметрыВыбораЭлементовФормы()

// Формирование настроек вариантов отчетов
//
&НаСервере
Функция ПолучитьНастройкуОтчета(КлючОтчета)
	
	Отчет = Отчеты.ОстаткиИОборотыТоваров.Создать();
	ВариантОтчета = Отчет.СхемаКомпоновкиДанных.ВариантыНастроек.Остатки.Настройки;
	
	Показатели      = ВариантОтчета.Выбор;
	Отбор = ВариантОтчета.Отбор;
	СтруктураОтчета = ВариантОтчета.Структура;
	СтруктураОтчета.Очистить();
	
	Для Каждого ТекПоказатель Из Показатели.Элементы Цикл
		Если ТипЗнч(ТекПоказатель) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
			ТекПоказатель.Использование = Истина;
			Для Каждого ТекВложенныйПоказатель Из ТекПоказатель.Элементы Цикл
				ТекВложенныйПоказатель.Использование = Истина;
			КонецЦикла;
		ИначеЕсли НЕ ТипЗнч(ТекПоказатель) = Тип("АвтоВыбранноеПолеКомпоновкиДанных") Тогда
			ТекПоказатель.Использование = Истина;
		КонецЕсли;
	КонецЦикла;
	
	// фильтры
	КоличествоПодчиненных = Отбор.Элементы.Количество()-1;
	Пока КоличествоПодчиненных >= 0 Цикл
		Отбор.Элементы.Удалить(Отбор.Элементы[КоличествоПодчиненных]);
		КоличествоПодчиненных = КоличествоПодчиненных - 1;
	КонецЦикла;
	
	ТаблицаОтчета = СтруктураОтчета.Добавить(Тип("ТаблицаКомпоновкиДанных"));
	
	// добавим измерение "Номенклатура"
	ГруппировкаНоменклатура = ОтчетыПлатформаСервер.СКД_ДобавитьГруппировку(ТаблицаОтчета.Строки, "Номенклатура");
	
	Возврат ВариантОтчета;
	
КонецФункции // ПолучитьНастройкуОтчета()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СЛУЖЕБНОГО ПРОГРАММНОГО ИНТЕРФЕЙСА

// Обработчик события возникающего при нажатии программно добавленной кнопки в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаКомандыФормыНаСервере(ИмяКоманды, ПараметрыДействия=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомСправочникаСервер.ОбработкаКомандыФормы(ЭтотОбъект, ИмяКоманды, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	Если Лев(ИмяКоманды,13) = "ВидПрайсЛиста" Тогда
		
		Для каждого КнопкаОперации Из Элементы.ВидПрайса.ПодчиненныеЭлементы Цикл
			КнопкаОперации.Пометка = (КнопкаОперации.Имя=ИмяКоманды);
		КонецЦикла;
		
		ПараметраПоиска = Новый Структура;
		ПараметраПоиска.Вставить("ИмяКоманды",ИмяКоманды);
		Для каждого Строка Из ВидыПрайсЛиста.НайтиСтроки(ПараметраПоиска) Цикл
			ВладелецПрайса = Строка.ВидПрайсЛиста;
			НастроитьПараметрыВыбораЭлементовФормы();
		КонецЦикла;
		Доступно = ЗначениеЗаполнено(ВладелецПрайса);
		Элементы.ФормаПодбор.Доступность    =Доступно;
		Элементы.ФормаОчистить.Доступность =Доступно;
		ЭтотОбъект.СохраняемыеВНастройкахДанныеМодифицированы = ИСТИНА;
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаКомандыФормыНаСервере()

// Обработчик события возникающего при нажатии программно добавленной кнопки.
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаКомандыФормы(Команда) Экспорт
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомСправочникаКлиент.ОбработкаКомандыФормы(ЭтотОбъект, Команда, Элементы.Список.ТекущиеДанные, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаКомандыФормыНаСервере(Команда.Имя, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // Подключаемый_ОбработкаКомандыФормы()

// Обработчик события возникающего при оповещении данной формы о прекращении работы подчиненной в контексте сервера.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаСервере
Процедура ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомСправочникаСервер.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаРезультатаОповещенияНаСервере()

// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаРезультатаОповещения(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	// Вызываем общий обработчик события в контексте клиента
	Если НЕ УправлениеСпискомСправочникаКлиент.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(РезультатОповещения);
	
КонецПроцедуры // Подключаемый_ОбработкаРезультатаОповещения()

// Отображает результат выполнения действия.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаКлиенте
Процедура ОбработкаРезультатаВыполненияДействия(ПараметрыДействия)
	
	// Вызываем общий обработчик результата выполнения действия
	УправлениеСпискомСправочникаКлиент.ОбработкаРезультатаВыполненияДействия(ЭтотОбъект, ПараметрыДействия);
	
КонецПроцедуры // ОбработкаРезультатаВыполненияДействия()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// Обработчик события возникающего на клиенте при выполнении команды "Подбор".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ЗакрыватьПриВыборе",Ложь);
	ПараметрыОткрытия.Вставить("РежимВыбора",Истина);
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыОткрытия, Элементы.Список);
	
КонецПроцедуры // Подбор()

// Обработчик события возникающего на клиенте при выполнении команды "Очистить".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура Очистить(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("Подключаемый_ОчиститьОбработкаРезультатаОповещения",ЭтотОбъект,"ОчисткаПрайсЛиста");
	ПоказатьВопрос(ОписаниеОповещения,НСтр("ru = 'Удалить все позиции из прайс-листа?'"),РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры // Очистить()

// Обработчик события возникающего при оповещении данной формы о прекращении работы подчиненной в контексте сервера.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаСервере
Процедура ОчиститьОбработкаРезультатаОповещенияНаСервере()
	
	УдаляемыеЭлементы = Новый СписокЗначений;
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	ПрайсЛист.Ссылка КАК Ссылка
	                    |ИЗ
	                    |	Справочник.ПрайсЛист КАК ПрайсЛист
	                    |ГДЕ
	                    |	ПрайсЛист.Владелец = &ИсходныйВладелец");
	Запрос.УстановитьПараметр("ИсходныйВладелец",ВладелецПрайса);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Ссылка.Уровень()=0 Тогда
			УдаляемыеЭлементы.Добавить(Выборка.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого УдаляемЭлемент Из УдаляемыеЭлементы Цикл
		УдаляемЭлементОбъект = УдаляемЭлемент.Значение.ПолучитьОбъект();
		Попытка
			УдаляемЭлементОбъект.Удалить();
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при удалении элемента справочника ""ПрайсЛист""'",
					ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()) + " " + СокрЛП(УдаляемЭлемент),УровеньЖурналаРегистрации.Ошибка,,,
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры // ОчиститьОбработкаРезультатаОповещенияНаСервере()

// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура Подключаемый_ОчиститьОбработкаРезультатаОповещения(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	Если ДополнительныеПараметры = "ОчисткаПрайсЛиста" И РезультатОповещения = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОчиститьОбработкаРезультатаОповещенияНаСервере();
		
	Элементы.Список.Обновить();
	Элементы.Дерево.Обновить();
	
КонецПроцедуры // Подключаемый_ОчиститьОбработкаРезультатаОповещения()

// Обработчик события возникающего на клиенте при выполнении команды "Заполнить".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура Заполнить(Команда)
	
	Для каждого ЭлементОтбора Из Список.Отбор.Элементы Цикл
		
		Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец") Тогда
			
			ПараметрыФормы      = Новый Структура("Владелец", ЭлементОтбора.ПравоеЗначение);
			ОткрытьФорму("Справочник.ПрайсЛист.Форма.ФормаАвтозаполнения", ПараметрыФормы, ЭтотОбъект, ЭтотОбъект, , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Обработчик события возникающего на клиенте при выполнении команды "Выгрузить".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура Выгрузить(Команда)
	
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("Справочник.ПрайсЛист.Форма.ФормаВыгрузки", ПараметрыФормы, ЭтотОбъект, ЭтотОбъект, , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

// Обработчик события возникающего на клиенте  при двойном щелчке мыши (нажатии клавиши Enter) в ячейке таблицы "Партии".
//
// Параметры:
//  Элемент         - ПолеФормы - Элемент управления, в котором возникло данное событие.
//  ВыбраннаяСтрока - Значение выбранной строки.
//  Поле            - ПолеФормы - Активное поле (колонка).
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения стандартной (системной) обработки события.
//
&НаКлиенте
Процедура ПартииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ВыбраннаяСтрока=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Партии.ТекущиеДанные;
	ТипДокумента = СтрЗаменить(ТипЗнч(ТекущиеДанные.Партия), " ", "");
	ПараметрыФормы = Новый Структура("Ключ", ТекущиеДанные.Партия);
	ОткрытьФорму("Документ."+ТипДокумента+".ФормаОбъекта", ПараметрыФормы, ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры // ПартииВыбор()

// Обработчик события возникающего на клиенте  при двойном щелчке мыши (нажатии клавиши Enter) в ячейке таблицы "Остатки".
//
// Параметры:
//  Элемент         - ПолеФормы - Элемент управления, в котором возникло данное событие.
//  ВыбраннаяСтрока - Значение выбранной строки.
//  Поле            - ПолеФормы - Активное поле (колонка).
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения стандартной (системной) обработки события.
//
&НаКлиенте
Процедура ОстаткиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ВыбраннаяСтрока = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка=Ложь;
	
	// фильтры
	ОтчетОтбор = Новый Структура;
	ОтчетОтбор.Вставить("СкладКомпании", Элементы.Остатки.ТекущиеДанные.СкладКомпании);
	ОтчетОтбор.Вставить("Номенклатура",  Элементы.Список.ТекущиеДанные.Номенклатура);
	
	НастройкиВарианта = ПолучитьНастройкуОтчета("ОстаткиИОборотыТоваров");
	
	ОтчетыПлатформаКлиент.ОткрытьОтчет("Отчет.ОстаткиИОборотыТоваров", "Остатки", НастройкиВарианта,,, ОтчетОтбор, , ОбщегоНазначенияКлиент.ДатаСеанса());
	
КонецПроцедуры // ОстаткиПоСкладамВыбор()

// Обработчик события возникающего на клиенте  при двойном щелчке мыши (нажатии клавиши Enter) в ячейке таблицы "Цены Контрагентов".
//
// Параметры:
//  Элемент         - ПолеФормы - Элемент управления, в котором возникло данное событие.
//  ВыбраннаяСтрока - Значение выбранной строки.
//  Поле            - ПолеФормы - Активное поле (колонка).
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения стандартной (системной) обработки события.
//
&НаКлиенте
Процедура ЦеныКонтрагентовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ВыбраннаяСтрока=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.ЦеныКонтрагентов.ТекущиеДанные;
	Отбор = Новый Структура("ТипЦен,Номенклатура", ТекущиеДанные.ТипЦен, ТекущиеДанные.Номенклатура);
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	ОткрытьФорму("РегистрСведений.Цены.ФормаСписка", ПараметрыФормы, ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры // ОстаткиВПроизводствеВыбор()

// Обработчик события возникающего на клиенте  при двойном щелчке мыши (нажатии клавиши Enter) в ячейке таблицы "Цены".
//
// Параметры:
//  Элемент         - ПолеФормы - Элемент управления, в котором возникло данное событие.
//  ВыбраннаяСтрока - Значение выбранной строки.
//  Поле            - ПолеФормы - Активное поле (колонка).
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения стандартной (системной) обработки события.
//
&НаКлиенте
Процедура ЦеныВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ВыбраннаяСтрока=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.Цены.ТекущиеДанные;
	Отбор = Новый Структура;
	Отбор.Вставить("ТипЦен",                     ТекущиеДанные.ТипЦен);
	Отбор.Вставить("Номенклатура",               ТекущиеДанные.Номенклатура);
	Отбор.Вставить("ХарактеристикаНоменклатуры", ТекущиеДанные.ХарактеристикаНоменклатуры);
	Отбор.Вставить("ЕдиницаИзмерения",           ТекущиеДанные.ЕдиницаИзмерения);
	Отбор.Вставить("ПодразделениеКомпании",      ТекущиеДанные.ПодразделениеКомпании);
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
	ОткрытьФорму("РегистрСведений.Цены.ФормаСписка", ПараметрыФормы, ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры // ЦеныВыбор()

// Обработчик события возникающего при переключении с одной страницы на другую.
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//  ТекущаяСтраница - ГруппаФормы - Новая активная страница.
//
&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		ТекущаяНоменклатура = Неопределено;
	Иначе
		ТекущаяНоменклатура = Элементы.Список.ТекущиеДанные.Номенклатура;
	КонецЕсли;
	
	Если Элементы.СтраницыРасширеннаяИнформация.ТекущаяСтраница.Имя = "СтраницаЦены" И ТаблицаПризнаковОткрытияВкладок.НайтиПоЗначению("СтраницаЦены").Пометка = Ложь Тогда
		Цены.Отбор.Элементы.Очистить();
		ЭлементОтбора = Цены.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Номенклатура");
		ЭлементОтбора.Использование  = ИСТИНА;
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = ТекущаяНоменклатура;
		ТаблицаПризнаковОткрытияВкладок.НайтиПоЗначению("СтраницаЦены").Пометка = Истина;
		
	ИначеЕсли Элементы.СтраницыРасширеннаяИнформация.ТекущаяСтраница.Имя = "СтраницаПартии" И ТаблицаПризнаковОткрытияВкладок.НайтиПоЗначению("СтраницаПартии").Пометка = Ложь Тогда
		Партии.Отбор.Элементы.Очистить();
		ЭлементОтбора = Партии.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Номенклатура");
		ЭлементОтбора.Использование  = ИСТИНА;
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = ТекущаяНоменклатура;
		ТаблицаПризнаковОткрытияВкладок.НайтиПоЗначению("СтраницаПартии").Пометка = Истина;
		
	ИначеЕсли Элементы.СтраницыРасширеннаяИнформация.ТекущаяСтраница.Имя = "СтраницаОстатки" И ТаблицаПризнаковОткрытияВкладок.НайтиПоЗначению("СтраницаОстатки").Пометка = Ложь Тогда
		Остатки.Отбор.Элементы.Очистить();
		ЭлементОтбора = Остатки.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Номенклатура");
		ЭлементОтбора.Использование  = ИСТИНА;
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = ТекущаяНоменклатура;
		ТаблицаПризнаковОткрытияВкладок.НайтиПоЗначению("СтраницаОстатки").Пометка = Истина;
		
	ИначеЕсли Элементы.СтраницыРасширеннаяИнформация.ТекущаяСтраница.Имя = "СтраницаЦеныКонтрагентов" И ТаблицаПризнаковОткрытияВкладок.НайтиПоЗначению("СтраницаЦеныКонтрагентов").Пометка = Ложь Тогда
		ЦеныКонтрагентов.Отбор.Элементы.Очистить();
		ЭлементОтбора = ЦеныКонтрагентов.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Номенклатура");
		ЭлементОтбора.Использование  = ИСТИНА;
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = ТекущаяНоменклатура;
		ТаблицаПризнаковОткрытияВкладок.НайтиПоЗначению("СтраницаЦеныКонтрагентов").Пометка = Истина;
	КонецЕсли;
	
КонецПроцедуры // СтраницыПриСменеСтраницы


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ДИНАМИЧЕСКОГО СПИСКА ФОРМЫ

// Обработчик события возникающего на клиенте при двойном щелчке мыши (нажатии Enter) в ячейке таблицы "Список".
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  ВыбраннаяСтрока      - Ссылка       - Значение выбранной строки.
//  Поле                 - ПолеФормы    - Активное поле.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаКлиент.СписокВыбор(ЭтотОбъект, Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка);
	
КонецПроцедуры // СписокВыбор()

// Обработчик события возникающего на клиенте при активизации строки списка с задержкой в контексте сервера.
//
&НаСервере
Процедура СписокПриАктивизацииСтрокиНаСервере()
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаСервер.СписокПриАктивизацииСтроки(ЭтотОбъект, Элементы.Список);
	
КонецПроцедуры // СписокПриАктивизацииСтрокиНаСервере()

// Обработчик события возникающего на клиенте при активизации строки списка выполняемый с задержкой.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_СписокПриАктивизацииСтроки()
	
	Если НЕ Элементы.СтраницыРасширеннаяИнформация.Видимость = Ложь ИЛИ НЕ Элементы.Список.ТекущаяСтрока = ЗначениеСтроки Тогда
		
		// Обновим данные для активизированной строки
		ЗначениеСтроки = Элементы.Список.ТекущаяСтрока;
		ТаблицаПризнаковОткрытияВкладок.НайтиПоЗначению("СтраницаЦены").Пометка = Ложь;
		ТаблицаПризнаковОткрытияВкладок.НайтиПоЗначению("СтраницаПартии").Пометка = Ложь;
		ТаблицаПризнаковОткрытияВкладок.НайтиПоЗначению("СтраницаОстатки").Пометка = Ложь;
		ТаблицаПризнаковОткрытияВкладок.НайтиПоЗначению("СтраницаЦеныКонтрагентов").Пометка = Ложь;
		
		СтраницыПриСменеСтраницы(Элементы.СтраницыРасширеннаяИнформация, Элементы.СтраницыРасширеннаяИнформация.ТекущаяСтраница);
		
	КонецЕсли;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомСправочникаКлиент.СписокПриАктивизацииСтроки(ЭтотОбъект, Элементы.Список, ИСТИНА) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	СписокПриАктивизацииСтрокиНаСервере();
	
КонецПроцедуры // Подключаемый_СписокПриАктивизацииСтроки()

// Обработчик события возникающего на клиенте при активизации строки списка.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаКлиент.СписокПриАктивизацииСтроки(ЭтотОбъект, Элемент);
	
КонецПроцедуры // СписокПриАктивизацииСтроки()

// Обработчик события возникающего на клиенте при активизации строки списка.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СписокПриАктивизацииЯчейки(Элемент)
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаКлиент.СписокПриАктивизацииЯчейки(ЭтотОбъект, Элемент);
	
КонецПроцедуры // СписокПриАктивизацииЯчейки()

// Обработчик события возникающего на клиенте перед добавления строки в таблицу "Список".
//
// Параметры:
//  Элемент     - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ       - Булево       - Признак отказа от действия.
//  Копирование - Булево       - Определяет режим копирования.
//  Родитель    - Ссылка       - Ссылка на элемент, который будет использован при добавлении в качестве родителя.
//  Группа      - Булево       - Признак добавления группы.
//  Параметр    - Произвольный - Параметр команды, выполняемой при добавлении строки в таблицу.
//
&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаКлиент.СписокПередНачаломДобавления(ЭтотОбъект, Элемент, Отказ, Копирование, Родитель, Группа, Параметр);
	
	Если НЕ ЗначениеЗаполнено(ВладелецПрайса) Тогда
		// Значение реквизита "Владелец" не заполнено
		ВывестиСообщение(НСтр("ru='Владелец не выбран.'"),ЭтотОбъект,,,Отказ);
	КонецЕсли;
	
КонецПроцедуры // СписокПередНачаломДобавления

// Обработчик события возникающего на клиенте перед началом изменения списка.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ   - Булево       - Признак отказа от действия.
//
&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаКлиент.СписокПередНачаломИзменения(ЭтотОбъект, Элемент, Отказ);
	
КонецПроцедуры // СписокПередНачаломИзменения()

// Обработчик события возникающего при выборе данных для таблицы "Список подразделений" в контексте сервера.
//
// Параметры:
//  ВыбранноеЗначение - Выбранное значение.
//
&НаСервере
Процедура СписокОбработкаВыбораНаСервере(ВыбранноеЗначение)
		
	Если ТипЗнч(ВыбранноеЗначение)=Тип("СправочникСсылка.Номенклатура") И НЕ ВыбранноеЗначение.ЭтоГруппа Тогда
		Если ДобавлятьТовар(ВыбранноеЗначение) Тогда
			
			НовыйЭлементПрайса=Справочники.ПрайсЛист.СоздатьЭлемент();
			НовыйЭлементПрайса.Владелец=ВладелецПрайса;
			НовыйЭлементПрайса.Наименование=ВыбранноеЗначение.Наименование;
			НовыйЭлементПрайса.Номенклатура=ВыбранноеЗначение;
			Если ЗначениеЗаполнено(Элементы.Список.ТекущийРодитель) Тогда
				НовыйЭлементПрайса.Родитель=Элементы.Список.ТекущийРодитель;
			КонецЕсли;
			Попытка
				НовыйЭлементПрайса.Записать();
			Исключение
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при записи элемента справочника ""ПрайсЛист""'",
					ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()) + " " + СокрЛП(НовыйЭлементПрайса.Ссылка),УровеньЖурналаРегистрации.Ошибка,,,
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // СписокОбработкаВыбораНаСервере

// Обработчик события возникающего на клиенте при выборе данных для таблицы "Список".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//  ВыбранноеЗначение - Выбранное значение.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения стандартной (системной) обработки события.
//
&НаКлиенте
Процедура СписокОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
		
	СписокОбработкаВыбораНаСервере(ВыбранноеЗначение);
	Элементы.Список.Обновить();
	
КонецПроцедуры // СписокОбработкаВыбора

// Обработчик события возникающего на клиенте после удаления строки списка.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СписокПослеУдаления(Элемент)
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаКлиент.СписокПослеУдаления(ЭтотОбъект, Элемент);
	
КонецПроцедуры // СписокПослеУдаления()

// Обработчик события возникающего на клиенте при изменении текущего родителя в режиме иерархического списка.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СписокПриСменеТекущегоРодителя(Элемент)
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаКлиент.СписокПриСменеТекущегоРодителя(ЭтотОбъект, Элемент);
	
КонецПроцедуры // СписокПриСменеТекущегоРодителя()

// Обработчик события возникающего при сохранении пользовательских настроек в контексте сервера.
// 
// Параметры:
//  Элемент   - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Настройки - ПользовательскиеНастройкиКомпоновкиДанных - Сохраняемые настройки. 
//
&НаСервере
Процедура СписокПриСохраненииПользовательскихНастроекНаСервере(Элемент, Настройки)
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаСервер.СписокПриСохраненииПользовательскихНастроекНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры // СписокПриСохраненииПользовательскихНастроекНаСервере()

// Обработчик события возникающего при восстановлении пользовательских настроек в контексте сервера.
// 
// Параметры:
//  Элемент   - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Настройки - ПользовательскиеНастройкиКомпоновкиДанных - Восстанавливаемые настройки. 
//
&НаСервере
Процедура СписокПриЗагрузкеПользовательскихНастроекНаСервере(Элемент, Настройки)
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаСервер.СписокПриЗагрузкеПользовательскихНастроекНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры // СписокПриЗагрузкеПользовательскихНастроекНаСервере()

// Обработчик события возникающего на сервере при обновлении пользовательских настроек списка.
//
// Параметры:
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаСервере
Процедура СписокПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаСервер.СписокПриОбновленииСоставаПользовательскихНастроекНаСервере(ЭтотОбъект, СтандартнаяОбработка);
	
КонецПроцедуры // СписокПриОбновленииСоставаПользовательскихНастроекНаСервере()

// Обработчик события вызывается на сервере после получения данных динамическим списком.
//
// Параметры:
//  ИмяЭлемента - Строка - Содержит имя таблицы формы, из которой вызван обработчик события.
//  Настройки   - НастройкиКомпоновкиДанных - Содержит копию полных настроек динамического списка.
//  Строки      - СтрокиДинамическогоСписка - Данные и оформление всех строк, получаемых в списке.
//
&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаСервер.СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки);
	
КонецПроцедуры // СписокПриПолученииДанныхНаСервере()

// Обработчик события возникающего на клиенте при движении курсора в поле приемнике данных.
//
// Параметры:
//  Элемент                 - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  ПараметрыПеретаскивания - Содержит перетаскиваемое значение, тип действия и возможные действия при перетаскивании.
//  СтандартнаяОбработка    - Булево - В данный параметр передается признак выполнения системной обработки события.
//  Строка                  - Содержит порядковый номер строки или ссылку на текущий объект.
//  Поле                    - Поле, с которым связана данная колонка таблицы, над которой находится объект.
//
&НаКлиенте
Процедура СписокПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаКлиент.СписокПроверкаПеретаскивания(ЭтотОбъект, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле);
	
КонецПроцедуры // СписокПроверкаПеретаскивания()

// Обработчик события возникающего на клиенте при окончании перетаскивания в поле-приемнике данных.
//
// Параметры:
//  Элемент                 - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  ПараметрыПеретаскивания - Содержит перетаскиваемое значение, тип действия и возможные действия при перетаскивании.
//  СтандартнаяОбработка    - Булево - В данный параметр передается признак выполнения системной обработки события.
//  Строка                  - Содержит порядковый номер строки или ссылку на текущий объект.
//  Поле                    - Поле, с которым связана данная колонка таблицы, над которой находится объект.
//
&НаКлиенте
Процедура СписокПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаКлиент.СписокПеретаскивание(ЭтотОбъект, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле);
	
КонецПроцедуры // СписокПеретаскивание()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ФОРМЫ

// Обработчик события возникающего на сервере при создании формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомСправочникаСервер.ПриСозданииНаСервере(ЭтотОбъект, Параметры, Отказ, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
	// Произведем настройку списка необходимых для проверки вкладок
	СписокНазванийВкладок = Новый Структура("СтраницаЦены,СтраницаЦеныКонтрагентов,СтраницаОстатки,СтраницаПартии");
	Для Каждого Вкладка Из СписокНазванийВкладок Цикл
		ТаблицаПризнаковОткрытияВкладок.Добавить(Вкладка.Ключ);
	КонецЦикла;
	
	Цены.Параметры.УстановитьЗначениеПараметра("НаДату",ТекущаяДатаСеанса());
	Цены.Параметры.УстановитьЗначениеПараметра("Контрагент",Справочники.Контрагенты.ПустаяСсылка());
	ЦеныКонтрагентов.Параметры.УстановитьЗначениеПараметра("НаДату",ТекущаяДатаСеанса());
	ЦеныКонтрагентов.Параметры.УстановитьЗначениеПараметра("Контрагент",Справочники.Контрагенты.ПустаяСсылка());
	
	// Обновим выпадающее меню у прайса
	ОбновитьСписокВидовПрайсов();
	
	Если Параметры.Отбор.Свойство("Владелец") И ЗначениеЗаполнено(Параметры.Отбор.Владелец) Тогда
		ВладелецПрайса = Параметры.Отбор.Владелец;
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()

// Обработчик события возникающего на клиенте при открытии формы, до показа окна пользователю.
//
// Параметры:
//  Отказ - Булево - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомСправочникаКлиент.ПриОткрытии(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	Доступно = ЗначениеЗаполнено(ВладелецПрайса);
	Элементы.ФормаПодбор.Доступность    =Доступно;
	Элементы.ФормаОчистить.Доступность =Доступно;
	Если НЕ Доступно Тогда
		ВладелецПрайса = ПредопределенноеЗначение("Справочник.ВидыПрайсЛистов.ОсновнойВидПрайсЛиста");
		НастроитьПараметрыВыбораЭлементовФормы();
	КонецЕсли;
	
	Для каждого КнопкаОперации Из Элементы.ВидПрайса.ПодчиненныеЭлементы Цикл
		КнопкаОперации.Пометка = (КнопкаОперации.Заголовок=Строка(ВладелецПрайса));
	КонецЦикла;
	
	СтраницыПриСменеСтраницы(Неопределено,Неопределено);
	
КонецПроцедуры // ПриОткрытии()

// Обработчик события возникающего на клиенте перед закрытием формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ЗавершениеРаботы     - Булево - Признак закрытия формы в процессе завершения работы приложения.
//  ТекстПредупреждения  - Булево - Сообщение пользователю не завершенной работе в данном окне.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомСправочникаКлиент.ПередЗакрытием(ЭтотОбъект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗакрытием()

// Обработчик события возникающего на клиенте при закрытии формы.
//
// Параметры:
//  ЗавершениеРаботы - Булево - Признак закрытия формы в процессе завершения работы приложения.
//
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомСправочникаКлиент.ПриЗакрытии(ЭтотОбъект, ЗавершениеРаботы) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗакрытии()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить в контексте сервера.
//
// Параметры:
//  ИмяСобытия        - Строка    - Имя, идентифицирующее событие.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомСправочникаСервер.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаОповещенияНаСервере()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить.
//
// Параметры:
//  ИмяСобытия - Строка       - Имя, идентифицирующее событие.
//  Параметр   - Произвольный - Параметр сообщения.
//  Источник   - Произвольный - Источник события.
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Производим подготовку параметров события для обработки в контексте сервера
	Если НЕ УправлениеСпискомСправочникаКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);

КонецПроцедуры // ОбработкаОповещения()

// Обработчик события возникающего на клиенте при вызове метода ОповеститьОбАктивизации из формы-владельца.
//
// Параметры:
//  АктивныйОбъект - Произвольный     - Активный объект.
//  Источник       - УправляемаяФорма - Форма, источник сообщения.
//
&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомСправочникаКлиент.ОбработкаАктивизации(ЭтотОбъект, АктивныйОбъект, Источник) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаАктивизации()

// Обработчик события возникающего на клиенте при записи объекта в одной из подчиненных форм.
//
// Параметры:
//  НовыйОбъект          - Произвольный     - Добавленный в подчиненной форме объект.
//  Источник             - УправляемаяФорма - Форма, источник сообщения.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомСправочникаКлиент.ОбработкаЗаписиНового(ЭтотОбъект, НовыйОбъект, Источник, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаписиНового()

// Обработчик события возникающего на сервере при сохранении значений реквизитов и настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраняемых реквизитов и настроек формы.
//
&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаСервер.ПриСохраненииДанныхВНастройкахНаСервере(ЭтотОбъект, Настройки);
	
	// Производим сохранение параметров отображения страниц расширенной информации
	Настройки.Вставить("ОтборПоВидуПрайсЛиста", ВладелецПрайса);
	
КонецПроцедуры // ПриСохраненииДанныхВНастройкахНаСервере()

// Обработчик события возникающего на сервере при восстановлении значений реквизитов из сохраненных настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраненных реквизитов и настроек формы.
//
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаСервер.ПриЗагрузкеДанныхИзНастроекНаСервере(ЭтотОбъект, Настройки);
	
	Если НЕ ЗначениеЗаполнено(ВладелецПрайса) Тогда
		ВладелецПрайса = Настройки.Получить("ОтборПоВидуПрайсЛиста");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВладелецПрайса) Тогда
		НастроитьПараметрыВыбораЭлементовФормы(); 
	КонецЕсли;
	
КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ
